In [32]:
import pandas as pd
import numpy as np

In [33]:
t=pd.read_csv("D:/Machine Learning/Titanic Kaggle/train.csv")   #training dataset
test=pd.read_csv("D:/Machine Learning/Titanic Kaggle/test.csv")   #test dataset

In [34]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [35]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [36]:
#check null values in training dataset
t.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [37]:
#check null values in test dataset
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

# #Data Preprocessing

Drop features consisting of high unique values and have less impact on ML models

In [38]:
#drop columns that don't contribute to the model learning
t=t.drop(['Ticket','Cabin'],axis=1)
test=test.drop(['Ticket','Cabin'],axis=1)

In [39]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [40]:
t.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [41]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S

# Data Analyzing

In [42]:
#Pclass vs Survived
print(t[['Pclass','Survived']].groupby(['Pclass'],as_index=False).count().sort_values(by='Survived',ascending=False))

   Pclass  Survived
2       3       491
0       1       216
1       2       184

In [43]:
#Age vs Survived
print(t[["Age",'Survived']].groupby(['Age'],as_index=False).count().sort_values(by='Survived',ascending=False))

      Age  Survived
31  24.00        30
28  22.00        27
23  18.00        26
39  30.00        25
36  28.00        25
24  19.00        25
27  21.00        24
33  25.00        23
48  36.00        22
38  29.00        20
42  32.00        18
47  35.00        18
35  27.00        18
34  26.00        18
41  31.00        17
21  16.00        17
29  23.00        15
45  34.00        15
25  20.00        15
44  33.00        15
52  39.00        14
53  40.00        13
56  42.00        13
22  17.00        13
59  45.00        12
51  38.00        11
6    2.00        10
8    4.00        10
65  50.00        10
63  48.00         9
..    ...       ...
70  55.00         2
73  57.00         2
2    0.75         2
14  10.00         2
60  45.50         2
43  32.50         2
85  71.00         2
17  13.00         2
54  40.50         2
83  70.00         2
75  59.00         2
40  30.50         2
79  63.00         2
37  28.50         2
86  74.00         1
84  70.50         1
82  66.00         1
0    0.42         1
71  55.50         1
68  53.00         1
49  36.50         1
46  34.50         1
1    0.67         1
32  24.50         1
30  23.50         1
26  20.50         1
19  14.50         1
16  12.00         1
4    0.92         1
87  80.00         1

[88 rows x 2 columns]

# Data Cleaning

In [44]:
t.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [45]:
test.isnull().sum()

PassengerId     0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked        0
dtype: int64

In [46]:
#combine the datasets in a list for Preprocessing
df=[t,test]

In [47]:
df[1].shape

(418, 9)

In [48]:
#Select a random number to replace nan values in Age column
#for loop takes one dataset at a time
for data in df:
    avg_age=data['Age'].mean()
    std_age=data['Age'].std()
    age_null_count=data['Age'].isnull().sum()
    age_null_list=np.random.randint(avg_age - std_age,avg_age + std_age,size=age_null_count)
    data['Age'][np.isnan(data['Age'])]=age_null_list
    data['Age']=data['Age'].astype(int)  #to convert the ages to integer format

C:\Users\Rishav\Anaconda3\lib\site-packages\ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [49]:
df[0].isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

In [50]:
df[1].isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           1
Embarked       0
dtype: int64

In [51]:
df[0].dtypes  #to check datatypes for eac feature

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age              int32
SibSp            int64
Parch            int64
Fare           float64
Embarked        object
dtype: object

In [52]:
#to check the correlation between features
df[0].corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.021542,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.074694,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.321564,0.083081,0.018443,-0.549500
Age,0.021542,-0.074694,-0.321564,1.000000,-0.226415,-0.169973,0.088198
SibSp,-0.057527,-0.035322,0.083081,-0.226415,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.169973,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.088198,0.159651,0.216225,1.000000

In [53]:
df[1].corr()

             PassengerId    Pclass       Age     SibSp     Parch      Fare
PassengerId     1.000000 -0.026751 -0.026956  0.003818  0.043080  0.008211
Pclass         -0.026751  1.000000 -0.435281  0.001087  0.018721 -0.577147
Age            -0.026956 -0.435281  1.000000 -0.080705 -0.034401  0.323704
SibSp           0.003818  0.001087 -0.080705  1.000000  0.306895  0.171539
Parch           0.043080  0.018721 -0.034401  0.306895  1.000000  0.230046
Fare            0.008211 -0.577147  0.323704  0.171539  0.230046  1.000000

In [54]:
#fill missing values in Embarked column with U as Unknown 
for data in df:
    data['Embarked'].fillna('U',inplace=True)

In [55]:
#map sex values using lambda function
for data in df:
    data['Sex']=data['Sex'].apply(lambda x:1 if x=='male' else 0)

In [56]:
#map Embarked values using lambda function
for data in df:
    data['Embarked']=data['Embarked'].apply(lambda x:2 if x=='S' else(1 if x=='C' else (0 if x=='Q' else 99)))

In [57]:
#check column names
df[0].columns.values

array(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked'], dtype=object)

In [58]:
df[1].columns.values

array(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked'], dtype=object)

In [60]:
df[1].isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           1
Embarked       0
dtype: int64

In [61]:
 #adjust the missing values of fare with median 
for data in df:
    data['Fare']=data['Fare'].fillna(test['Fare'].mean())
    data['Fare']=data['Fare'].astype(float)

In [62]:
df[1].isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
dtype: int64

In [63]:
# Get titles from the names
"""The Escape Symbol : \
If you want to match for the actual ‘+’, ‘.’ etc characters, add a backslash( \ ) before that character.
This will tell the computer to treat the following character as a search character and consider it for matching pattern."""
for d in df:
    d['Title'] = d.Name.str.extract(' ([A-Za-z]+)\.', expand=False)

In [64]:
df[0].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",1,22,1,0,7.2500,2,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38,1,0,71.2833,1,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",0,26,0,0,7.9250,2,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35,1,0,53.1000,2,Mrs
4,5,0,3,"Allen, Mr. William Henry",1,35,0,0,8.0500,2,Mr

In [65]:
#drop name column
t=t.drop(["Name"],axis=1)
test=test.drop(["Name"],axis=1)

In [66]:
df=[t,test]

In [67]:
df[0].head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,1,22,1,0,7.2500,2,Mr
1,2,1,1,0,38,1,0,71.2833,1,Mrs
2,3,1,3,0,26,0,0,7.9250,2,Miss
3,4,1,1,0,35,1,0,53.1000,2,Mrs
4,5,0,3,1,35,0,0,8.0500,2,Mr

In [68]:
#final checking for missing values
for d in df:
       print( d.isnull().sum())

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
Title          0
dtype: int64
PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       0
Title          0
dtype: int64

In [69]:
#get the unique titles from the dataset's Title column
for d in df:
    print(d.Title.unique())

['Mr' 'Mrs' 'Miss' 'Master' 'Don' 'Rev' 'Dr' 'Mme' 'Ms' 'Major' 'Lady'
 'Sir' 'Mlle' 'Col' 'Capt' 'Countess' 'Jonkheer']
['Mr' 'Mrs' 'Miss' 'Master' 'Ms' 'Col' 'Rev' 'Dr' 'Dona']

In [70]:
#map each title to a specific integer
title_mapping = {'Mr':0, 'Mrs':1, 'Miss':2,'Master':3, 'Don':4, 'Rev':5, 'Dr':6, 'Mme':7, 'Ms':8,'Major':9,'Lady':9,
 'Sir':9, 'Mlle':9, 'Col':9, 'Capt':9, 'Countess':9, 'Jonkheer':9,'Dona':9}
#finally map the integers to their respective title keys
for d in df:
    d['Title'] = d['Title'].map(title_mapping)

In [71]:
df[0].head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,1,22,1,0,7.2500,2,0
1,2,1,1,0,38,1,0,71.2833,1,1
2,3,1,3,0,26,0,0,7.9250,2,2
3,4,1,1,0,35,1,0,53.1000,2,1
4,5,0,3,1,35,0,0,8.0500,2,0

In [72]:
t.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title
0,1,0,3,1,22,1,0,7.2500,2,0
1,2,1,1,0,38,1,0,71.2833,1,1
2,3,1,3,0,26,0,0,7.9250,2,2
3,4,1,1,0,35,1,0,53.1000,2,1
4,5,0,3,1,35,0,0,8.0500,2,0

In [73]:
#show the columns in dataset
t.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked', 'Title'],
      dtype='object')

In [74]:
test.columns

Index(['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked', 'Title'],
      dtype='object')

In [75]:
#split in x and y and drop target variable from training dataset
y=t['Survived']
x=t.drop(['Survived','PassengerId'],axis=1)

In [76]:
#x_test will be the testing dataset for our model and PassengerId should be dropped
x_test=test.drop(["PassengerId"],axis=1).copy()

In [77]:
#check the datatypes of features in test dataset
x_test.dtypes

Pclass        int64
Sex           int64
Age           int32
SibSp         int64
Parch         int64
Fare        float64
Embarked      int64
Title         int64
dtype: object

In [78]:
#import StandarScaler to Scale the training dataset against outliers
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()

In [79]:
#prepare the model to scale and apply it to training dataset
x=sc.fit_transform(x)
#apply the scaling model to test dataset
x_test=sc.transform(x_test)

In [80]:
#import train_test_split
from sklearn.model_selection import train_test_split

In [81]:
#split the training dataset into train and test to check the model's accuracy before fitting to actual test  dataset
x_train,x_t,y_train,y_t=train_test_split(x,y,test_size=.20,random_state=40)

# Applying Algorithm RandomForest

In [82]:
#import RandomForest
from sklearn.ensemble import RandomForestClassifier

C:\Users\Rishav\Anaconda3\lib\site-packages\sklearn\ensemble\weight_boosting.py:29: DeprecationWarning: numpy.core.umath_tests is an internal NumPy module and should not be imported. It will be removed in a future NumPy release.
  from numpy.core.umath_tests import inner1d

In [83]:
#create a RandomForest classifier object
cls=RandomForestClassifier(criterion='entropy',min_samples_split=.05,random_state=0,n_estimators=100)

In [84]:
#Train RandomForest Classifier model
cls.fit(x_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='entropy',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=0.05,
            min_weight_fraction_leaf=0.0, n_estimators=100, n_jobs=1,
            oob_score=False, random_state=0, verbose=0, warm_start=False)

In [85]:
#classify on test dataset created by splitting from actual training dataset
y_pred=cls.predict(x_t)

In [86]:
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix,classification_report

In [87]:
#check accuracy of model
accuracy_score(y_pred,y_t)

0.8603351955307262

In [88]:
#check the confusion matrix
confusion_matrix(y_pred,y_t)

array([[96, 18],
       [ 7, 58]], dtype=int64)

In [89]:
#classifiication report
print(classification_report(y_pred,y_t))

             precision    recall  f1-score   support

          0       0.93      0.84      0.88       114
          1       0.76      0.89      0.82        65

avg / total       0.87      0.86      0.86       179

# Applying K-Fold cross validation

In [ ]:
from sklearn.model_selection import cross_val_score

In [ ]:
#validate the model with 10 combination
acc=cross_val_score(estimator=cls,X=x_train,y=y_train,cv=10)

In [ ]:
#check the bias(mean) and variance(std)
print(acc.std())
print(acc.mean())

# Predicting Survived using model on x_test

In [ ]:
#classify the actual test dataset
Y_pred=cls.predict(x_test)

In [31]:
#creating submission dataframe
submission=pd.DataFrame({"PassengerId":test['PassengerId'],"Survived":Y_pred})

NameError: name 'Y_pred' is not defined

In [67]:
#save to desired location
submission.to_csv("D:/Machine Learning/Titanic Kaggle/sub1.csv",index=False)

# Since I am getting the best results using RandomForest Classifier on this dataset as RandomForest works bestwith categorical features I am commenting out the other two algorithms I used for tweakingas to which one works best

# Applying SVM

In [76]:
#from sklearn.svm import SVC

In [77]:
#creating SVM classifier
#cls1=SVC(kernel='rbf',random_state=0)

In [78]:
#train the SVM model
#cls1.fit(x_train,y_train)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto', kernel='rbf',
  max_iter=-1, probability=False, random_state=0, shrinking=True,
  tol=0.001, verbose=False)

In [79]:
#cross checking with validation dataset
#y_pred=cls1.predict(x_t)

In [80]:
#accuracy_score(y_t,y_pred)

0.8491620111731844

In [81]:
#confusion_matrix(y_pred,y_t)

array([[91, 15],
       [12, 61]], dtype=int64)

In [82]:
#print(classification_report(y_pred,y_t))

             precision    recall  f1-score   support

          0       0.88      0.86      0.87       106
          1       0.80      0.84      0.82        73

avg / total       0.85      0.85      0.85       179

In [83]:
#validating model on K_Fold cross validation where K=10
#acc=cross_val_score(estimator=cls,X=x_train,y=y_train,cv=10)

In [84]:
#check the bias(mean) and variance(std)
#print(acc.std())
#print(acc.mean())

0.03003601286008376
0.824563492063492

In [85]:
#Y_pred1=cls1.predict(x_test)

In [86]:
#submission1=pd.DataFrame({"PassengerId":test['PassengerId'],'Survived':Y_pred1})

In [87]:
#submission1.to_csv("D:/Machine Learning/Titanic Kaggle/sub2.csv",index=False)

Applying Grid Search to tune the parameters

In [137]:
#from sklearn.model_selection import GridSearchCV

In [140]:
#param=[{'C': [1,10,100,200,500], 'kernel':['linear']},
        {'C': [1,10,100,200,500], 'kernel':['rbf'] , 'gamma': [0.1,0.01,0.001]}]

In [141]:
#grid_search=GridSearchCV(estimator=cls1, param_grid=param, scoring='accuracy', cv=10 )

In [142]:
#gd=grid_search.fit(x_train,y_train)

In [143]:
#gd.best_score_

0.8174157303370787

In [144]:
#gd.best_params_

{'C': 100, 'gamma': 0.01, 'kernel': 'rbf'}

# Applying Logistic Regression

In [184]:
#from sklearn.linear_model import LogisticRegression

In [185]:
#cls2=LogisticRegression()

In [187]:
#cls2.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [188]:
#y_pred=cls2.predict(x_t)

In [189]:
#accuracy_score(y_t,y_pred)

0.8324022346368715

In [190]:
#confusion_matrix(y_t,y_pred)

array([[89, 14],
       [16, 60]], dtype=int64)